# Вивести кожне число зі списку

numbers = [1, 2, 3, 4, 5]

# for index in range(5):
#     print(numbers[index])

# for index in range(len(numbers)):
#     print(numbers[index])

for i in numbers:
    print(i)

# Підрахунок парних чисел
# Умова:
# Створи масив із 10 будь-яких чисел. За допомогою циклу підрахуй, скільки серед них парних чисел.
# Приклад масиву:
# [1, 4, 7, 10, 12, 3, 6, 9, 8, 5]
# Очікуваний результат:
# 5 парні числа
# Мета: навчити перевіряти парність числа та використовувати цикл

print('==============')
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
counter = 0
for i in numbers:
    if i % 2 == 0:
        counter += 1

print(f'Парні числа: {counter}')
print('==============')
# Сума всіх чисел у масиві
# Умова:
# Створи масив із 5 чисел. За допомогою циклу порахуй суму всіх чисел у цьому масиві.
# Приклад масиву:
# [3, 7, 2, 5, 6]
# Очікуваний результат:
# 23
# Мета: закріпити використання циклу та змінної-суматора.
numbers = [1, 2, 3, 4, 5]

total = 0
for i in numbers:
    total += i

print(f'Сума всіх чисел: {total}')

# Умова:
# Є об’єкт (словник), у якому зберігаються імена студентів та їхній пропуски. За допомогою циклу виведи на екран усіх студентів у такому форматі:
# Ім'я: Петро, Пропусків: 18
students = {
    "Петро": 18,
    "Оля": 20,
    "Іван": 17
}

for i in students:
    print(f"Ім'я: {i}, Пропусків: {students[i]}")